app/views/users/search.html.erb

SELECT "rentals".* FROM "rentals" WHERE "rentals"."deleted_at" IS NULL AND "rentals"."user_id" = ?  [["user_id", 2]]
---
              <div class='rental-info'>
                <% u.rentals.each do |r| %>