app/controllers/rentals_controller.rb

  def search
    @rental = Rental.includes(:user).order("created_at DESC")
---
SELECT "rentals".* FROM "rentals" INNER JOIN "users" ON "users"."id" = "rentals"."user_id" WHERE "rentals"."deleted_at" IS NULL AND (user.name LIKE ?) ORDER BY created_at DESC