app/controllers/rentals_controller.rb

SELECT "rentals".* FROM "rentals" WHERE "rentals"."deleted_at" IS NULL ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
---
  def index
      rentals = Rental.includes(:user).order("created_at DESC")
      @rentals = rentals.page(params[:page]).per(8)

SELECT "rentals".* FROM "rentals" WHERE "rentals"."deleted_at" IS NULL AND "rentals"."equipment_id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def search
    if rental_params[:equipment_id].present?
      @rentals = Rental.where('equipment_id LIKE ?', "%#{rental_params[:equipment_id]}%")

INSERT INTO "rentals" ("reserve_schedule_date", "reserve_actual_date", "return_schedule_date", "return_actual_date", "return_over_date", "status_id", "equipment_id", "code", "reason", "apply", "rental_confirmation", "return_confirmation", "deleted_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @rental = Rental.new(rental_params)
    if @rental.save