app/controllers/rentals_controller.rb

SELECT "rentals".* FROM "rentals" ORDER BY created_at DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?, ?)  [["id", 3], ["id", 2], ["id", 1]]
SELECT "users".* FROM "users" INNER JOIN "rentals" ON "rentals"."deleted_at" IS NULL AND "rentals"."user_id" = "users"."id"
SELECT COUNT(*) FROM "rentals" WHERE "rentals"."deleted_at" IS NULL
SELECT "rentals".* FROM "rentals" INNER JOIN "users" ON "users"."id" = "rentals"."user_id" WHERE "rentals"."deleted_at" IS NULL AND (user.name LIKE ?) ORDER BY created_at DESC
---
  def index
      rentals = Rental.includes(:user).order("created_at DESC")
      @rentals = rentals.page(params[:page]).per(10)

SELECT "rentals".* FROM "rentals" WHERE "rentals"."deleted_at" IS NULL AND (equipment LIKE ?) ORDER BY created_at DESC
SELECT "rentals".* FROM "rentals" WHERE "rentals"."deleted_at" IS NULL AND "rentals"."status_id" IS NULL ORDER BY created_at DESC
SELECT "users".* FROM "users" WHERE (name LIKE ?) ORDER BY created_at DESC
---
  def search
    if rental_params[:equipment_id].present?
      @rentals = Rental.where('equipment_id LIKE ?', "%#{rental_params[:equipment_id]}%").order("created_at DESC")
    elsif rental_params[:status_id].present?
      @rentals = Rental.where('status_id LIKE ?', "%#{rental_params[:status_id]}%").order("created_at DESC")
    elsif rental_params[:rental_user].present?

SELECT "rentals".* FROM "rentals" WHERE "rentals"."deleted_at" IS NULL AND "rentals"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def permission
    @rental = Rental.find(rental_params[:id])

SELECT "rentals".* FROM "rentals" WHERE "rentals"."deleted_at" IS NULL AND "rentals"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def no_permission
    @rental = Rental.find(rental_params[:id])

SELECT "rentals".* FROM "rentals" WHERE "rentals"."deleted_at" IS NULL LIMIT ?  [["LIMIT", 1]]
UPDATE "rentals" SET "status_id" = ?, "permission" = ?, "updated_at" = ? WHERE "rentals"."id" = ?  [["status_id", 2], ["permission", 1], ["updated_at", "2022-05-01 14:38:34.131805"], ["id", 1]]
UPDATE "rentals" SET "reserve_actual_date" = ?, "status_id" = ?, "updated_at" = ? WHERE "rentals"."id" = ?  [["reserve_actual_date", "2022-05-06"], ["status_id", 5], ["updated_at", "2022-05-06 11:17:23.024348"], ["id", 14]]
UPDATE "rentals" SET "return_actual_date" = ?, "status_id" = ?, "user_id" = ?, "updated_at" = ? WHERE "rentals"."id" = ?  [["return_actual_date", "2022-05-06"], ["status_id", 4], ["user_id", 1], ["updated_at", "2022-05-06 09:46:02.057851"], ["id", 13]]
UPDATE "rentals" SET "return_actual_date" = ?, "status_id" = ?, "lending" = ?, "user_id" = ?, "updated_at" = ? WHERE "rentals"."id" = ?  [["return_actual_date", "2022-05-10"], ["status_id", 4], ["lending", "返却済み"], ["user_id", 1], ["updated_at", "2022-05-10 20:57:51.951724"], ["id", 15]]
---
  def update
    @rental = Rental.find(rental_params[:id])
    if @rental.status_id == 1 && rental_params[:permission]
      @rental.status_id = 2
      @rental.lending = "貸出中"
      @rental.reserve_actual_date = Date.today
      if @rental.update(rental_params)
        redirect_to root_path
      else
        render :permission
      end
    elsif @rental.status_id == 1 && rental_params[:confirmation]
      @rental.status_id = 5
      if @rental.update(rental_params)
        redirect_to root_path
      else
        render :permission
      end
    elsif @rental.status_id == 2 && rental_params[:permission]
      @rental.status_id = 3
      if @rental.update(rental_params)
        redirect_to root_path
      else
        render :permission
      end
    elsif @rental.status_id == 3 && rental_params[:permission]
      @rental.status_id = 4
      @rental.lending = "返却済み"
      @rental.return_actual_date = Date.today
      if @rental.update(rental_params)

UPDATE "rentals" SET "status_id" = ?, "lending" = ?, "permission" = ?, "user_id" = ?, "updated_at" = ? WHERE "rentals"."id" = ?  [["status_id", 6], ["lending", "取消済み"], ["permission", 1], ["user_id", 1], ["updated_at", "2022-05-23 19:49:19.819187"], ["id", 10]]
---
    elsif @rental.status_id == 5 && rental_params[:permission]
      @rental.status_id = 6
      @rental.lending = "取消済み"
      if @rental.update(rental_params)

UPDATE "rentals" SET "status_id" = ?, "lending" = ?, "user_id" = ?, "updated_at" = ? WHERE "rentals"."id" = ?  [["status_id", 8], ["lending", "貸出却下"], ["user_id", 1], ["updated_at", "2022-05-23 19:49:09.422117"], ["id", 16]]
---
    else
      @rental.status_id = 8
      @rental.lending = "貸出却下"
      if @rental.update(rental_params)

INSERT INTO "rentals" ("reserve_schedule_date", "reserve_actual_date", "return_schedule_date", "return_actual_date", "return_over_date", "status_id", "equipment_id", "code", "rental_user", "reason", "lending", "permission", "confirmation", "deleted_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @rental = Rental.new(rental_params)
    @rental.rental_user = current_user.name
    if @rental.save

SELECT "rentals".* FROM "rentals" WHERE "rentals"."deleted_at" IS NULL AND "rentals"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_rental
    @rental = Rental.find(params[:id])