app/controllers/users_controller.rb

  def search
    if user_params[:name].present?
      @users = User.where('name LIKE ?', "%#{user_params[:name]}%")
---
SELECT "users".* FROM "users" WHERE (name LIKE '%テスト%')